Repository: createdwithlove/news
Catalog: Resources/Private/Language/*.locallang_csh_news.xlf
Languages: uk

# .description
source: News record
uk: Запис новин

# .details
source: Versatile news system.
uk: Універсальна система новин.

# sys_language_uid.description
source: Language of the news record.
uk: Мова запису новин.

# starttime.description
source: Define a date on which the news record should be shown.
uk: Визначте дату показу запису новин.

# endtime.description
source: Define a date on which the news record should be hidden.
uk: Визначте дату, коли запис новини має бути приховано.

# fe_group.description
source: Select the user groups which are allowed to see the news record.
uk: Виберіть групи користувачів, яким дозволено переглядати запис новин.

# editlock.description
source: If checked, this news record can only be edited by administrators.
uk: Якщо позначено, цей запис новин можуть редагувати лише адміністратори.

# hidden.description
source: Hidden records are not shown in the frontend.
uk: Приховані записи не відображаються у фронтенді.

# title.description
source: News title
uk: Заголовок новини

# alternative_title.description
source: Alternative Title will be used as the title for the browser window / tab
uk: Альтернативний заголовок використовуватиметься як заголовок для вікна/вкладки браузера

# teaser.description
source: Be aware that it can be cropped.
uk: Майте на увазі, що його можна обрізати.

# type.description
source: Select the type which can be either a normal news record, a link to an internal page or a link to an external page.
uk: Виберіть тип, яким може бути звичайний запис новин, посилання на внутрішню сторінку або посилання на зовнішню сторінку.

# istopnews.description
source: Top news records can get a special treated concerning layout, sorting, ...
uk: Записи найпопулярніших новин можуть отримати особливу обробку щодо компонування, сортування, ...

# author.description
source: Author of the news record
uk: Автор запису новин

# author_email.description
source: Email address of the author
uk: Електронна адреса автора

# datetime.description
source: Date of the news record
uk: Дата запису новини

# archive.description
source: Archive date. A date is required if the news record should once be treated as archived news.
uk: Дата архіву. Дата обов’язкова, якщо запис новин колись слід буде розглядати як архівні новини.

# bodytext.description
source: Main content of the news record
uk: Основний зміст запису новин

# categories.description
source: Select the categories which are related to this record.
uk: Виберіть категорії, пов’язані з цим записом.

# tags.description
source: Define and select tags which fit to the article.
uk: Визначте та виберіть теги, які підходять до статті.

# content_elements.description
source: Content elements can be used to generate feature rich news articles.
uk: Елементи вмісту можна використовувати для створення статей новин, в яких багато функцій.

# keywords.description
source: Define keywords which can be used for SEO optimizations.
uk: Визначте ключові слова, які можна використовувати для оптимізації SEO.

# description.description
source: Define a description which can be used for SEO optimizations.
uk: Визначте опис, який можна використовувати для оптимізації SEO.

# related.description
source: Select related news records.
uk: Виберіть відповідні записи новин.

# related_from.description
source: Show news which select current news record as related.
uk: Показати новини, які вибирають поточний запис новин як споріднений.

# related_links.description
source: Define related links to internal and external pages.
uk: Визначте відповідні посилання на внутрішні та зовнішні сторінки.
