Repository: createdwithlove/news
Catalog: Resources/Private/Language/*.locallang_csh_flexforms.xlf
Languages: fi, uk

# switchableControllerActions.description
source: Set the view you want to display
fi: Aseta näkymä, jonka haluat näyttää
uk: Встановіть вид, який ви хочете відобразити

# switchableControllerActions.details
source: List view shows all news records. Latest uses a time restriction, the rest should be understandable
fi: Luettelonäkymässä näkyvät kaikki uutiset. Viimeisin käyttää aikarajoitusta, loput tulisi olla ymmärrettäviä
uk: Перегляд списку показує всі записи новин. Останні використовують обмеження за часом, решта мають бути зрозумілими

# settings.orderBy.description
source: Define the sorting field
fi: Määritä lajittelukenttä
uk: Визначене поле сортування

# settings.orderDirection.description
source: Define the sorting direction
fi: Määritä lajittelusuunta
uk: Визначте напрямок сортування

# settings.dateField.description
source: Select the field which is used to build the date menu.
fi: Valitse kenttä, jota käytetään päivämäärävalikon luomiseen.
uk: Виберіть поле, яке використовується для створення меню дати.

# settings.categories.description
source: Choose the categories to define which news items are displayed
fi: Valitse luokat määritelläksesi mitä uutisia näytetään
uk: Виберіть категорії, щоб визначити, які новини відображаються

# settings.categoryConjunction.description
source: Define how the selected categories are used
fi: Määritä, kuinka valittuja luokkia käytetään
uk: Визначте, як використовуються вибрані категорії

# settings.includeSubCategories.description
source: Include all subcategories of the selected categories too.
fi: Sisällytä myös kaikki valittujen luokkien alaluokat.
uk: Також включити всі підкатегорії вибраних категорій.

# settings.categoryConjunction.details
source: "Don't care": No category restriction is set. "Show items with selected categories OR": A news records need to be related with at least one of the selected categories. "Show selected categories AND". A news record need to be related to all selected categories. "Do not show" is the opposite of above.
fi: "Älä välitä": Luokkarajoituksia ei ole asetettu. "Näytä kohteet valituilla kategorioilla OR": Uutistietueiden on oltava yhteydessä ainakin yhteen valituista luokista."Näytä valitut luokat AND". Uutiset on liitettävä kaikkiin valittuihin luokkiin. "Älä näytä" on päinvastainen kuin yllä.
uk: «Байдуже»: обмеження категорії не встановлено. «Показати елементи з вибраними категоріями АБО»: записи новин мають бути пов’язані принаймні з однією з вибраних категорій. «Показати вибрані категорії І». Запис новини має бути пов’язаний із усіма вибраними категоріями. "Не показувати" є протилежністю вищезазначеному.

# settings.archiveRestriction.description
source: Choose between: 1) Show all news records, 2) Show only active news records, 3) Show only archived news records. The archive date is defined in each news record. If no archive date is set, the news record can't be archived.
fi: Valitse seuraavista: 1) Näytä kaikki uutiset, 2) Näytä vain aktiiviset uutiset, 3) Näytä vain arkistoidut uutiset. Arkistopäivämäärä määritetään jokaisessa uutiskirjeessä. Jos arkistointiajankohtaa ei ole asetettu, uutisia ei voida arkistoida.
uk: Виберіть між: 1) Показати всі записи новин, 2) Показати лише активні записи новин, 3) Показати лише архівні записи новин. У кожному записі новини вказується дата архіву. Якщо дата архівування не встановлена, запис новин не можна архівувати.

# settings.timeRestriction.description
source: Set a time limit. This can either be an integer and means seconds, e.g. 86400 means 1 day(60 * 60 * 24) or a string like "-4 days" or "-3 hours". The prepended - is important! Only news items after the given time are shown.
fi: Aseta aikaraja. Tämä voi olla joko kokonaisluku ja tarkoittaa sekuntia, esim. 86400 tarkoittaa yhtä päivää (60 * 60 * 24) tai merkkijonoa, kuten "-4 päivää" tai "-3 tuntia". Prepended - on tärkeätä! Vain uutiset tietyn ajan kuluttua näytetään.
uk: Встановіть ліміт часу. Це може бути цілим числом і означати секунди, напр. 86400 означає 1 день (60 * 60 * 24) або такий рядок, як «-4 дні» або «-3 години». Початок - це важливо! Відображаються лише новини після вказаного часу.

# settings.timeRestrictionHigh.description
source: Set a time limit. This can either be an integer and means seconds, e.g. 86400 means 1 day(60 * 60 * 24) or a string like "-4 days" or "-3 hours". The prepended - is important! Only news items before the given time are shown.
fi: Aseta aikaraja. Tämä voi olla joko kokonaisluku ja tarkoittaa sekuntia, esim. 86400 tarkoittaa yhtä päivää (60 * 60 * 24) tai merkkijonoa, kuten "-4 päivää" tai "-3 tuntia". Prepended - on tärkeätä! Vain uutiset tietyn ajan kuluttua näytetään.
uk: Встановіть ліміт часу. Це може бути цілим числом і означати секунди, напр. 86400 означає 1 день (60 * 60 * 24) або такий рядок, як «-4 дні» або «-3 години». Початок - це важливо! Відображаються лише новини до вказаного часу.

# settings.topNewsRestriction.description
source: A news record can be set as top news. Therefore it can be defined to show either all news records, only top news or only nontop news.
fi: Uutisrekisteri voidaan asettaa ylimmäksi uutiseksi. Siksi voidaan määritellä näyttämään joko kaikki uutiset, vain tärkeimmät uutiset tai vain ei-tärkeätuutiset.
uk: Запис новини можна встановити як головну новину. Тому його можна визначити для показу всіх записів новин, лише головних новин або лише непопулярних новин.

# settings.singleNews.description
source: Display the selected single news record.
fi: Näytä valittu yksittäinen uutistietue.
uk: Відобразити вибраний єдиний запис новин.

# settings.previewHiddenRecords.description
source: If set, hidden records are also displayed. This is needed if you want to preview still hidden records. Be aware that any hidden records on the current page are shown as well.
fi: Jos asetettu, piilotetut tietueet näkyvät myös. Tätä tarvitaan, jos haluat esikatsella edelleen piilotettuja tietueita. Huomaa, että myös nykyisen sivun piilotetut tietueet näkyvät.
uk: Якщо встановлено, приховані записи також відображаються. Це потрібно, якщо ви хочете попередньо переглянути все ще приховані записи. Майте на увазі, що всі приховані записи на поточній сторінці також відображаються.

# settings.startingpoint.description
source: Define the pages/sysfolders which hold the news records
fi: Määritä uutistietueita sisältävät sivut / kansiot
uk: Визначте сторінки/системні папки, які містять записи новин

# settings.recursive.description
source: Select the recursion level of the startingpoint.
fi: Valitse lähtöpisteen rekursiotaso.
uk: Виберіть рівень рекурсії початкової точки.

# settings.detailPid.description
source: Select the page on which the detail view should be shown.
fi: Valitse sivu, jolla yksityiskohtanäkymä tulee näyttää.
uk: Виберіть сторінку, на якій має відображатися детальний перегляд.

# settings.backPid.description
source: Select the page which is used to return to on detail view.
fi: Valitse sivu, jota käytetään palaamaan yksityiskohtinäkymään.
uk: Виберіть сторінку, на яку потрібно повернутися в детальному перегляді.

# settings.listPid.description
source: Select the page on which the list view is shown.
fi: Valitse sivu, jolla luettelonäkymä näkyy.
uk: Виберіть сторінку, на якій відображається список.

# settings.limit.description
source: Set the maximum amount of news records to be displayed
fi: Aseta näytettävien uutistietueiden enimmäismäärä
uk: Встановіть максимальну кількість записів новин для відображення

# settings.offset.description
source: Set the offset to start with. E.g. 3 means that the first 2 records are not rendered.
fi: Aseta siirtymä alkamaan. Esimerkiksi. 3 tarkoittaa, että kahta ensimmäistä tietuetta ei suoriteta.
uk: Встановіть зміщення для початку. наприклад 3 означає, що перші 2 записи не відображаються.

# settings.topNewsFirst.description
source: If checked: No matter which sorting is defined, top news are shown as first news records.
fi: Jos valittu: riippumatta siitä, mikä lajittelu on määritelty, tärkeät uutiset näytetään ensimmäisinä uutistietueina.
uk: Якщо позначено: незалежно від того, яке сортування визначено, головні новини відображаються як перші записи новин.

# settings.disableOverrideDemand.description
source: If checked, this plugin won't be influenced through the override demand settings which can be e.g. a category via URL parameter.
fi: Jos tämä valitaan, tähän laajennukseen ei vaikuteta ohitusvaatimusasetusten kautta, jotka voivat olla esimerkiksi luokka URL-parametrin kautta.
uk: Якщо позначено, на цей плагін не впливатимуть параметри перевизначення вимог, які можуть бути, напр. категорію через параметр URL.

# settings.tags.description
source: Filter by given tags.
fi: Suodata annettujen tagien mukaan.
uk: Фільтрувати за заданими тегами.

# settings.media.maxWidth.description
source: Maximal width of media elements (images, videos, ...)
fi: Mediaelementtien (kuvat, videot, ...) enimmäisleveys
uk: Максимальна ширина медіа елементів (зображення, відео, ...)

# settings.media.maxHeight.description
source: Maximal height of media elements (images, videos, ...)
fi: Mediaelementtien (kuvat, videot, ...) enimmäiskorkeus
uk: Максимальна висота медіа елементів (зображення, відео, ...)

# settings.cropMaxCharacters.description
source: Define the length of the teaser in chars. The teaser is typically cropped in the list view.
fi: Määritä tiisetin pituus merkeissä. Tiiseri on yleensä rajattu luettelonäkymässä.
uk: Визначте довжину тизера в символах. Тизер зазвичай обрізається у списку.

# settings.templateLayout.description
source: Select a special layout for displaying news records.
fi: Valitse erityinen asettelu uutistallenteiden näyttämistä varten.
uk: Виберіть спеціальний макет для відображення новин.
