Repository: createdwithlove/news
Catalog: Resources/Private/Language/*.locallang_csh_category.xlf
Languages: da, fi, pl, ru

# .description
source: Category record
da: Tag element
fi: Kategoriatallenne
pl: Rekord kategorii
ru: Запись метки

# .details
source: Category for news records.
da: Nyhedselementer kan tagges gennem disse elementer
fi: Mediamääritykset uutiselle
pl: Kategoria dla rekordów wiadomości.
ru: Записи новостей могут быть помечены этими записями

# _.seeAlso
source: See also the website http://www.news.com/
da: Se også websitet http://www.news.com/
fi: Katso myös verkkosivusto http://www.news.com/
pl: Zobacz również stronę http://www.news.com/
ru: Смотрите также сайт http://www.news.com/

# sys_language_uid.description
source: Language of the category
da: Kategoriens sprog
fi: Kategorian kieli
pl: Język kategorii
ru: Язык категории

# hidden.description
source: Hidden categories are never shown in the frontend.
da: Skjulte elementer vises aldrig i frontend.
fi: Piilotetut elementit eivät näy www-sivuilla.
pl: Ukryte kategorie nigdy nie są wyświetlane w frontendzie.
ru: Скрытые элементы ни при каких условиях не выводятся на сайте.

# title.description
source: Title of the category
da: Titel på tag.
fi: Kategorian titteli
pl: Tytuł kategorii
ru: Название метки.

# parentcategory.description
source: Select a parent category of this record to build a category tree.
da: Vælg en overkategori for at opbygge en hierarkisk struktur.
fi: Valitse tämän tallenteen pääluokka rakentaaksesi kategoriapuun.
pl: Wybierz kategorię nadrzędną tego rekordu, aby zbudować drzewo kategorii.
ru: Выберете родительскую категорию для текущей записи для построения дерева категорий.

# image.description
source: Optional image of a category.
da: Valgfrit kategoribillede.
fi: Kategorian vaihtoehtoinen kuva.
pl: Opcjonalny obraz kategorii.
ru: Возможный значок для категории.

# description.description
source: Optional description of a category.
da: Valgfri beskrivelse af valgt fil.
fi: Valinnainen kuvaus kategoriasta.
pl: Opcjonalny opis kategorii.
ru: Возможное описание для выбранного файла.

# single_pid.description
source: Choose a page which is used to show the detail view of news records related with this category. This setting is overridden with a configured page inside the plugin's settings.
da: Vælg hvilken side, der skal benyttes til detaljevisning af nyheder relateret til denne kategori. Indstillingen kan overskrives i nyhedsmodulets indstillinger.
fi: Valitse sivu, jota käytetään näyttämään yksityiskohtainen näkymä tähän luokkaan liittyvistä uutisista. Tämä asetus ohitetaan konfiguroidulla sivulla laajennuksen asetusten sisällä.
pl: Wybierz stronę, która jest używana do wyświetlania szczegółów aktualności związanych z tą kategorią. To ustawienie jest zastąpione skonfigurowaną stroną w ustawieniach wtyczki.
ru: Выберете страницу, которая используется для вывода полного текста статей из текущей категории. Эта настройка может быть переопределена в соответствующих настройках дополнения.

# shortcut.description
source: Optional link of a category.
da: Valgfrit kategorilink.
fi: Valinnainen linkki kategoriaan.
pl: Opcjonalny link kategorii.
ru: Возможная ссылка категории.
